app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function processLogin()
    {
        // $username = $this->request->getPost('username');
        // $password = $this->request->getPost('password');

        // $user = $this->userModel->where('username', $username)->first();

        // if ($user && password_verify($password, $user['password'])) {
        //     session()->set([
        //         'user_id' => $user['id'],
        //         'username' => $user['username'],
        //         'role' => $user['role'],
        //         'logged_in' => true,
        //     ]);
        //     return redirect()->to('/dashboard');
        // } else {
        //     return redirect()->back()->with('error', 'Username atau Password salah');
        // }

        /* Debuging password */
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();