app/Controllers/Guru.php

SELECT *
FROM `guru`
---
    public function index()
    {
        $data['guru'] = $this->guruModel->findAll();

        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Daftar Guru',
            'guru' => $this->guruModel->findAll(),

INSERT INTO `guru` (`nama`, `nip`, `alamat`, `telepon`) VALUES ('fatimah', '1111', NULL, NULL)
---
    public function store()
    {
        $this->guruModel->save([
            'nama' => $this->request->getPost('nama'),
            'nip' => $this->request->getPost('nip'),
            'alamat' => $this->request->getPost('alamat'),
            'telepon' => $this->request->getPost('telepon')
        ]);

DELETE FROM `guru`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $this->guruModel->delete($id);