app/Controllers/MataPelajaran.php

SELECT *
FROM `mata_pelajaran`
---
    public function create()
    {
        $data['mata_pelajaran'] = $this->mataPelajaranModel->findAll();

SELECT *
FROM `mata_pelajaran`
WHERE `mata_pelajaran`.`id` = '1'
---
    public function siswa($pelajaran_id)
    {
        $data['siswa'] = $this->siswaPelajaranModel->getSiswaByPelajaran($pelajaran_id);
        $data['pelajaran'] = $this->mataPelajaranModel->find($pelajaran_id);

SELECT *
FROM `mata_pelajaran`
WHERE `mata_pelajaran`.`id` = '1'
---
    public function edit($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $mata_pelajaran = $this->mataPelajaranModel->find($id);

UPDATE `mata_pelajaran` SET `nama_pelajaran` = 'BAHASA INDONESIA'
WHERE `mata_pelajaran`.`id` IN ('1')
---
    public function update($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $this->mataPelajaranModel->update($id, [
            'nama_pelajaran' => $this->request->getPost('nama_pelajaran'),
        ]);