app/Controllers/Siswa.php

SELECT *
FROM `siswa`
---
    public function index()
    {
        $data['siswa'] = $this->siswaModel->findAll();

        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Daftar Siswa',
            'siswa' => $this->siswaModel->findAll(),