app/Models/MataPelajaranModel.php

SELECT `mata_pelajaran`.*, `guru`.`nama` as `guru_nama`
FROM `mata_pelajaran`
JOIN `guru` ON `guru`.`id` = `mata_pelajaran`.`guru_id`
---
    public function getWithGuru()
    {
        return $this->select('mata_pelajaran.*, guru.nama as guru_nama')
                    ->join('guru', 'guru.id = mata_pelajaran.guru_id')
                    ->findAll();