app/Models/SiswaPelajaranModel.php

SELECT `siswa_pelajaran`.*, `siswa`.`nama` as `siswa_nama`, `siswa`.`kelas`
FROM `siswa_pelajaran`
JOIN `siswa` ON `siswa`.`id` = `siswa_pelajaran`.`siswa_id`
WHERE `pelajaran_id` = '1'
---
    public function getSiswaByPelajaran($pelajaran_id)
    {
        return $this->select('siswa_pelajaran.*, siswa.nama as siswa_nama, siswa.kelas')
                    ->join('siswa', 'siswa.id = siswa_pelajaran.siswa_id')
                    ->where('pelajaran_id', $pelajaran_id)
                    ->findAll();